app/views/products/index.html.erb

<script type="text/javascript" charset="utf-8">
$(function() {
  $(".js-more").on("click", function() {
    var id = $(this).data("id");
    $.get("/products/" + id + ".json", function(data) {
        // var product = data["product"];
        var inventoryText = "<strong>Available</strong>";
         if(data["inventory"] === 0){
          inventoryText = "<strong>Sold Out</strong>";
         }
        var descriptionText = "<p>" + data["description"] + "</p><p>" + inventoryText + "</p>";
        $("#product-" + id).html(descriptionText);

    });
  });
});
---
SELECT "products".* FROM "products"